# Pandas数据帧

数据帧(DataFrame)是二维数据结构，即数据以行和列的表格方式排列。
数据帧(DataFrame)的功能特点：
    潜在的列是不同的类型
    大小可变
    标记轴(行和列)
    可以对行和列执行算术运算
    
pandas中的DataFrame可以使用以下构造函数创建 -
pandas.DataFrame( data, index, columns, dtype, copy)
编号	参数	   描述
1	  data	   数据采取各种形式，如:ndarray，series，map，lists，dict，constant和另一个DataFrame。
2	  index  	对于行标签，要用于结果帧的索引是可选缺省值np.arrange(n)，如果没有传递索引值。
3	  columns	对于列标签，可选的默认语法是 - np.arange(n)。 这只有在没有索引传递的情况下才是这样。
4	  dtype	   每列的数据类型。
5	  copy	   如果默认值为False，则此命令(或任何它)用于复制数据。

# 创建一个空的DataFrame

In [59]:
#引入模块
import pandas as pd
import numpy as np

In [60]:
df01= pd.DataFrame()
print(df01)

Empty DataFrame
Columns: []
Index: []

# 从列表创建DataFrame

In [61]:
data = [1,2,3,4]
df02 = pd.DataFrame(data)
df02

   0
0  1
1  2
2  3
3  4

In [152]:
data = [['joe',18],['susan',19],['black',20,30]]
# df03 = pd.DataFrame(data)
# df03 = pd.DataFrame(data,columns = ['name','age'])
df03 = pd.DataFrame(data,columns = ['name','age','aa'],dtype = float)
df03

    name   age    aa
0    joe  18.0   NaN
1  susan  19.0   NaN
2  black  20.0  30.0

# 从列表字典来创建DataFrame

In [63]:
data = {'Name':['Tom','Jack','Steve'],'Age':[19,18,20]}
# df04 = pd.DataFrame(data)
#指定行索引和列索引
df04 = pd.DataFrame(data,index = ['rank1','rank2','rank3'],columns = ['Name','Age','Sex'])
df04

        Name  Age  Sex
rank1    Tom   19  NaN
rank2   Jack   18  NaN
rank3  Steve   20  NaN

# 从字典列表创建数据帧DataFrame

In [108]:
data = [{'a':1,'b':2},{'a':1,'b':2,'c':3}]
# df05 = pd.DataFrame(data)
#传递字典列表指定行索引
# df05 = pd.DataFrame(data,index = ['first','second'])
#传递字典列表指定行索引，列索引
df05 = pd.DataFrame(data,index = ['first','second'],columns = ['a','b','c','d'])
df05
#注意 - 观察到，NaN(不是数字)被附加在缺失的区域。

        a  b    c   d
first   1  2  NaN NaN
second  1  2  3.0 NaN

In [109]:
df05.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [110]:
df05 = df05[columns[2:]]
df05

NameError: name 'columns' is not defined

# 从系列的字典来创建DataFrame

In [65]:
data = {
    'one':pd.Series([1,2,3],index = ['a','b','c']),
    'two':pd.Series([1,2,3,4],index = ['a','b','c','d'])
}
df06 = pd.DataFrame(data)
df06
#注意 - 对于第一个系列，观察到没有传递标签'd'，但在结果中，对于d标签，附加了NaN。

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

# 列选择

下面将通过从数据帧(DataFrame)中选择一列。

In [81]:
#直接通过列索引来获取某一列的值
data = {
    'one':pd.Series([1,2,3],index = ['a','b','c']),
    'two':pd.Series([1,2,3,4],index = ['a','b','c','d'])
}
df06 = pd.DataFrame(data)
df06

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [150]:
df06['one']
# df06.one
# df06.ix[:,'one']
# df06.loc[:,'one']
# df06.iloc[:,0]

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

# 列添加

下面将通过向现有数据框添加一个新列来理解这一点。

In [135]:
data = {
    'one':pd.Series([1,2,3],index = ['a','b','c']),
    'two':pd.Series([1,2,3,4],index = ['a','b','c','d'])
}
df06 = pd.DataFrame(data)
df06['three'] = pd.Series([10,20,30],index = ['a','b','c'])
df06

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

# 列修改

In [137]:
#直接通过列名进行修改
df06['three'] = [7,8,9,10]
df06

   one  two  three
a  1.0    1      7
b  2.0    2      8
c  3.0    3      9
d  NaN    4     10

# 列删除

In [13]:
data = {
    'one':pd.Series([1,2,3],index = ['a','b','c']),
    'two':pd.Series([1,2,3,4],index = ['a','b','c','d']),
    'three':pd.Series([10,20,30],index = ['a','b','c'])
}
df06 = pd.DataFrame(data)
#使用del删除列
# del(df06['three'])

#使用pop删除
df06.pop('two')
df06

   one  three
a  1.0   10.0
b  2.0   20.0
c  3.0   30.0
d  NaN    NaN

# 行选择，添加和删除

In [130]:
data = {
    'one':pd.Series([1,2,3],index = ['a','b','c']),
    'two':pd.Series([1,2,3,4],index = ['a','b','c','d']),
    'three':pd.Series([10,20,30],index = ['a','b','c'])
}
df06 = pd.DataFrame(data)
df06

   one  three  two
a  1.0   10.0    1
b  2.0   20.0    2
c  3.0   30.0    3
d  NaN    NaN    4

In [131]:
#可以通过将行标签传递给loc函数或者ix函数来选择行
# df06.loc['a']
df06.loc[:,'two']
# df06.ix['a']

a    1
b    2
c    3
d    4
Name: two, dtype: int64

In [132]:
# 按整数位置选择
# 可以通过将整数位置传递给iloc函数来选择行。参考以下示例代码 -
df06.iloc[2]

one       3.0
three    30.0
two       3.0
Name: c, dtype: float64

In [133]:
# 行切片
# 可以使用:运算符选择多行。参考以下示例代码 -
df06[2:4]

   one  three  two
c  3.0   30.0    3
d  NaN    NaN    4

In [134]:
#添加行
# df06.ix['e'] = [22,33,444]
df06.loc['e'] = [22,33,444]
df06

    one  three  two
a   1.0   10.0    1
b   2.0   20.0    2
c   3.0   30.0    3
d   NaN    NaN    4
e  22.0   33.0  444

In [129]:
# 添加加行
# 使用append()函数将新行添加到DataFrame。 此功能将附加行结束。
#创建一行数据
# data2 = pd.DataFrame([{'one':22,'two':33,'three':44}],index = ['e'])
data2 = pd.DataFrame([[22,33,44]],columns = ['one','two','three'],index = ['f'])
# data2 
df06 = df06.append(data2)
df06

    one  three  two
a   1.0   10.0    1
b   2.0   20.0    2
c   3.0   30.0    3
d   NaN    NaN    4
e  22.0   33.0  444
f  22.0   44.0   33

# 删除行

In [52]:
df06 = df06.drop('e')
df06

   one  three  two
a  1.0   10.0    1
b  2.0   20.0    2
c  3.0   30.0    3
d  NaN    NaN    4

# （2）DatatFrame 基本属性

编号	属性或方法	描述
1	T	转置行和列。
2	axes	返回一个列，行轴标签和列轴标签作为唯一的成员。
3	dtypes	返回此对象中的数据类型(dtypes)。
4	empty	如果NDFrame完全为空[无项目]，则返回为True; 如果任何轴的长度为0。
5	ndim	轴/数组维度大小。
6	shape	返回表示DataFrame的维度的元组。
7	size	NDFrame中的元素数。
8	values	NDFrame的Numpy表示。
9	head()	返回开头前n行。
10	tail()	返回最后n行。

In [62]:
#创建数据
datas = {
    'name':pd.Series(['Tom','Joe','Suan','Jack']),
    'age' :pd.Series([18,19,20,21]),
    'rating':pd.Series([4.23,5.43,3.67,4.55])
}
df07 = pd.DataFrame(datas)
df07

   age  name  rating
0   18   Tom    4.23
1   19   Joe    5.43
2   20  Suan    3.67
3   21  Jack    4.55

In [60]:
#属性1：T   返回DataFrame转置.将行列交换
df07.T

           0     1     2     3
age       18    19    20    21
name     Tom   Joe  Suan  Jack
rating  4.23  5.43  3.67  4.55

In [63]:
#属性2：axes  返回行轴标签和列轴标签
df07.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['age', 'name', 'rating'], dtype='object')]

In [65]:
#属性3：dtypes 返回每列的数据类型
df07.dtypes

age         int64
name       object
rating    float64
dtype: object

In [66]:
#属性:4：empty 返回布尔值，表示对象是否为空
df07.empty

False

In [67]:
#属性5：ndim 返回对象的维数。根据定义，DataFrame是一个2D对象。
df07.ndim

2

In [68]:
#属性6：shape 返回表示DataFrame 的维度元组  元组(a，b)，其中a表示行数，b表示列数。
df07.shape

(4, 3)

In [69]:
#属性7：size 返回DataFrame 中的元素个数
df07.size

12

In [71]:
#属性8：values 返回DataFrame 中的实际数据作为ndarray返回
df07.values

array([[18, 'Tom', 4.23],
       [19, 'Joe', 5.43],
       [20, 'Suan', 3.67],
       [21, 'Jack', 4.55]], dtype=object)

In [73]:
#属性9:head 返回前n行数据
# df07.head()
df07.head(2)

   age name  rating
0   18  Tom    4.23
1   19  Joe    5.43

In [75]:
#属性10:tail 返回最后n行数据
# df07.tail()
df07.tail(2)

   age  name  rating
2   20  Suan    3.67
3   21  Jack    4.55